#pragma once

#include "../Object/ObjectBase/CObjectBase.hpp"


class CLaser : public CObjectBase
{

	/*=========================================================*/
	//!
	//! \file
	//! \class CLaser
	//! \brief <b>レーザーを管理するクラス</b>
	//!
	//! \author Y.Yamamuro \n
	//! \date  2014/11/26
	//! \since 2014/11/26
	//!
	/*=========================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CLaser( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CLaser( void );


	/*==========================================================================*/
	//! \brief 更新
	//! \param[in]	_RayPos		レーザーを伸ばす際に使用する始点と終点
	/*==========================================================================*/
	void Exec( CRaycastLine _RayPos );


	/*===========================================*/
	//! \brief レーザーのメッシュを返す
	/*===========================================*/
	CXFile** GetLaserXFile( void ){ return m_lpLaserEffect; }

private:

	/*==============================================*/
	//! \brief レーザーの頂点座標を格納
	/*==============================================*/
	void SetLaserVertex( void );


	/*================================================================================*/
	//! \brief レーザーのメッシュをAGLの先端、ヒットした座標に合わせる
	//! \param[in]		_Line	始点、終点が格納された座標
	/*================================================================================*/
	void LaserMeshTransform( CRaycastLine _Line );


	static const int LaserEffectNum = 2;
	CXFile *m_lpLaserEffect[LaserEffectNum];	//!< レーザーのエフェクト
	D3DXVECTOR3 *m_Vertex[LaserEffectNum];		//!< レーザーの頂点座標
	DWORD NumVertex[LaserEffectNum];			//!< メッシュの頂点数を格納

};