#pragma once 

#include "../GimmickBase/CGimmickBase.hpp"


class CConveyer : public CGimmickBase
{

	/*===========================================================*/
	//!
	//! \file
	//! \class CConveyer
	//! \brief <b>ボックスを運ぶコンベアの管理クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date 2014/09/16
	//! \since 
	//!
	/*===========================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CConveyer( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CConveyer( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


};