#pragma once

#include "../GimmickBase/CGimmickBase.hpp"

/*===================================*/
//!< 前方宣言
/*===================================*/
class CPlayer;


class CWireMesh : public CGimmickBase
{

	/*===========================================================*/
	//!
	//! \file
	//! \class CWireMesh
	//! \brief <b>金網管理用クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date  2014/10/02
	//! \since 2014/10/07
	//! \since 2014/11/21 ギミックに変更
	//!
	/*===========================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CWireMesh( void );

	/*===================================*/
	//! \brief 個別の初期化
	/*===================================*/
	void DiscreteInit( void );

	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CWireMesh( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


	/*=============================================*/
	//! \brief 描画
	//! \param[in] &_d3d	DirectXのデバイス
	/*=============================================*/
	void Draw( CDirect3D & _d3d );


private:

	static const int WireMeshNum = 10;		//!< 設置する金網の数

	//!< 座標を参照するために使用
	CPlayer* m_pPlayer;						//!< プレイヤーのオブジェクト

	D3DXVECTOR3 m_Pos[WireMeshNum];			//!< 各金網の座標

	float m_Scale;							//!< メッシュの拡縮率

	CXFile *m_lpGap;						//!< 金網の隙間

	NxActor *m_Actors[WireMeshNum];			//!< 金網のアクター

};
