#pragma once

#include "../Object/ObjectBase/CObjectBase.hpp"


class CBridge : public CObjectBase
{

	/*========================================*/
	//! 
	//! \file
	//! \class CBridge
	//! \brief <b>橋オブジェクトの管理クラス</b>
	//! 
	//! \author Y.Yamamuro \n
	//! \date 2014/09/16
	//! 
	/*========================================*/

public:
	
	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CBridge( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CBridge( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );

	
};