#pragma once 

class CDirect3D;

class CLightManager
{

	/*===================================================*/
	//!
	//! \file
	//! \class CLightManager
	//! \brief <b>ライトの管理クラス</b>
	//!
	//! \author Y.Yamamuro \n
	//! \date  2014/10/31
	//! \since 2014/11/03
	//!
	/*===================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CLightManager( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CLightManager( void );


	/*===========================================================*/
	//! \brief ライトを追加する
	//! \param[in]	_Light		追加するライト
	//! \param[in]	_Flag		ライトのON,OFF
	//! \return インデックス番号
	/*===========================================================*/
	int AddLight( D3DLIGHT9 _Light , BOOL _Flag = TRUE );


	/*============================================================*/
	//! \brief ライトの状態を更新する
	//! \param[in]	_Light		更新するライト
	//! \param[in]	_Index		更新するライトのインデックス番号
	//! \param[in]	_Flag		ライトのON,OFF
	/*============================================================*/
	void UpdateLight( D3DLIGHT9 _Light , int _Index , BOOL _Flag = TRUE );


	/*===============================================================*/
	//! \brief ライトの設定を変更する
	//! \param[in]	_Index		変更するライトのインデックス番号
	//! \param[in]	_Flag		ライトのON,OFF
	/*===============================================================*/
	void SetLightFlag( DWORD _Index , BOOL _Flag );

	/*==============================================================*/
	//! \brief すべてのライトの設定を変更する
	//! \param[in]	_Flag		ライトのON,OFF
	/*==============================================================*/
	void SetAllLightFlag( BOOL _Flag );


	/*========================================*/
	//! \brief ライトを全て消す
	/*========================================*/
	void AllDelete( void );


private:

	int m_LightNum;			//!< 現在管理しているライトの数

	CDirect3D *m_pd3d;		//!< CDirect3Dのポインタ

	std::vector< D3DLIGHT9 > m_LightList;	//!< 現在使用しているライトのリスト

};