#pragma once 

#include "CDirect3D.hpp" 

class CSprite
{

	/*===================================================*/
	//!
	//! \file
	//! \class CSprite
	//! \brief <b>スプライトの管理クラス</b>
	//!
	//! \author Y.Yamamuro \n
	//! \date  2014/10/01
	//! \since 2014/10/01
	//!
	/*===================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CSprite( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CSprite( void );


	/*=========================================================*/
	//! \brief スプライトの描画開始処理
	//! \brief 描画終了時にはEnd()をコールする
	/*=========================================================*/
	void Begin( void );


	/*=========================================================*/
	//! \brief スプライトの描画終了処理
	//! \brief 描画開始時にはBegin()をコールする
	/*=========================================================*/
	void End( void );


	/*========================================================================*/
	//! \brief テクスチャの読み込み
	//! \note テクスチャマネージャを作成したらそちらに移動させる
	//! \param[out]	_lpTex		テクスチャのポインタを格納する
	//! \param[in]	_FilePass	ファイル名を指定
	//! \param[in]	_Width		ピクセル単位でテクスチャの幅を指定
	//! \param[in]	_Height		ピクセル単位でテクスチャの高さを指定
	//! \param[in]	_Color		透明にする色の指定
	/*========================================================================*/
	void LoadText( LPDIRECT3DTEXTURE9 *_lpTex , std::string _FilePass , int _Width , int _Height , D3DCOLOR _Color );


	/*=====================================*/
	//! \brief CSpriteを返す
	/*=====================================*/
	inline const LPD3DXSPRITE& GetSprite( void ){ return m_lpSprite; }


private:

	static LPD3DXSPRITE m_lpSprite;		//!< CSpriteのポインタ

};