#pragma once

#include "../GimmickBase/CGimmickBase.hpp"


class CLiftY : public CGimmickBase
{

	/*===========================================================*/
	//!
	//! \file
	//! \class CLiftY
	//! \brief <b>Y軸へ移動するリフト管理用クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date 2014/09/10
	//!
	/*===========================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CLiftY( void );

	/*===================================*/
	//! \brief 個別の初期化
	/*===================================*/
	void DiscreteInit( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CLiftY( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


	/*=================================================*/
	//! \brief 進行方向にレイを飛ばし、距離を返す
	/*=================================================*/
	float MoveCheck( void );


private:

	static const bool MoveUp   = false;		//!< m_MoveFlagで使用	上方向に進ませる際に使用
	static const bool MoveDown = true;		//!< m_MoveFlagで使用	下方向に進ませる際に使用

	bool m_MoveFlag;						//!< 現在どちらの方向に進んでいるかのフラグ

	int FreezeCount;						//!< 各端まで進んだ時の一時停止のカウンタ
	static const int FreezeTime = 200;		//!< 停止させるフレーム数

	NxActor *m_Stopper;						//!< 落下を停止させるためのストッパー

};
