#pragma once 

#include "../GimmickBase/CGimmickBase.hpp"


class CBalance : public CGimmickBase
{

	/*========================================================================*/
	//!
	//! \file
	//! \class CBalance
	//! \brief <b>重さによって高さの変動する天秤のような床の管理クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date 2014/09/10
	//! \since 
	//!
	/*========================================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CBalance( void );

	/*===================================*/
	//! \brief 個別の初期化
	/*===================================*/
	void DiscreteInit( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CBalance( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


private:

};

