#include "stdafx.hpp"

#include "../GimmickBase/CGimmickBase.hpp"
#include "CBalance.hpp"



/*===============================================*/
//! \brief デフォルトコンストラクタ
/*===============================================*/
CBalance::CBalance( void )
{
}


/*===================================*/
//! \brief 個別の初期化
/*===================================*/
void CBalance::DiscreteInit( void )
{
}


/*=====================================*/
//! \brief デストラクタ
/*=====================================*/
CBalance::~CBalance( void )
{
}


/*================================*/
//! \brief 更新
/*================================*/
void CBalance::Exec( void )
{
}