#pragma once

/*===================================*/
//!< 前方宣言
/*===================================*/
class CPlayer;
class CParticleEmitter;

#include "../Object/ObjectBase/CObjectBase.hpp"
#include "../LaserBase/CLaserBase.hpp"


class CAntiGravityLaser : public CLaserBase
{

	/*=========================================================*/
	//!
	//! \file
	//! \class CAntiGravityLaser
	//! \brief <b>AGLを管理するクラス</b>
	//!
	//! \author Y.Yamamuro \n
	//! \date  2014/09/16
	//! \since 2014/09/27
	//!
	/*=========================================================*/

public:

	/*===============================================*/
	//! \brief コンストラクタ
	/*===============================================*/
	CAntiGravityLaser( CPlayer *_pPlayer );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CAntiGravityLaser( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


private:

	/*==============================================*/
	//! \brief 左クリック時のアクション
	/*==============================================*/
	void LeftClickAction( void );

	/*==============================================*/
	//! \brief 右クリック時のアクション
	/*==============================================*/
	void RightClickAction( void );

	
};