#pragma once

class CTexture
{

	/*===================================================*/
	//!
	//! \file
	//! \class CTexture
	//! \brief <b>1つのテクスチャの管理</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date  2014/11/07
	//! \since 2014/11/07
	//!
	/*===================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CTexture( void );

	/*====================================================================*/
	//! \brief コンストラクタ
	//! \param[in]		_lpDirect3D		DirectXのデバイス
	//! \param[in]		_FilePass		テクスチャがあるファイルのパス
	/*====================================================================*/
	CTexture( LPDIRECT3DDEVICE9 _lpDirect3D , std::string _FilePass );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CTexture( void );


	/*==============================================================================*/
	//! \brief テクスチャを読み込む
	//! \param[in]		_lpDirect3D		DirectXのデバイス
	//! \param[in]		_FilePass		テクスチャがあるファイルのパス
	/*==============================================================================*/
	void Load( LPDIRECT3DDEVICE9 _lpDirect3D , std::string _FilePass );
	

	/*==============================================*/
	//! \brief 自身の管理するテクスチャを返す
	/*==============================================*/
	inline LPDIRECT3DTEXTURE9 GetTexture( void ) const { return m_lpTexture; }


	/*===================================================================*/
	//! \note これ以降の関数に関しては使用時に最善の注意をする事！
	/*===================================================================*/

	/*===============================================*/
	//! \brief テクスチャをセットする
	/*===============================================*/
	inline void SetTexture( LPDIRECT3DTEXTURE9 _lpTexture ){ m_lpTexture = _lpTexture; }


	/*==================================================*/
	//! \brief テクスチャをバックアップを元に復元
	/*==================================================*/
	inline void Restore( void ){ m_lpTexture = m_lpBackup; }


private:

	// 自身の管理するテクスチャを格納
	LPDIRECT3DTEXTURE9 m_lpTexture;

	// テクスチャ更新時に元の状態に戻せるようにするためのバックアップ
	LPDIRECT3DTEXTURE9 m_lpBackup;

};