#pragma once 

#include "../GimmickBase/CGimmickBase.hpp"


class CClueLever : public CGimmickBase
{

	/*=================================================================*/
	//!
	//! \file
	//! \class CClueLever
	//! \brief <b>ヒントを教えてもらえるレバーの管理クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date 2014/09/16
	//! \since 
	//!
	/*=================================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CClueLever( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CClueLever( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


};