#pragma once

#include "../Object/ObjectBase/CObjectBase.hpp"


class CFence : public CObjectBase
{

	/*===============================================*/
	//!	
	//! \file
	//! \class CFence
	//!	\brief <b>立ち入り禁止のフェンス</b>
	//!
	//! \author Y.Yamamuro \n
	//! \date  2014/10/02
	//! \since 2014/10/02
	//!
	/*================================================*/

public:
	
	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CFence( void );

	/*===================================*/
	//! \brief 個別の初期化
	/*===================================*/
	void DiscreteInit( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CFence( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


	/*=============================================*/
	//! \brief 描画
	//! \param[in] &_d3d	DirectXのデバイス
	/*=============================================*/
	void Draw( CDirect3D &_d3d );


};