#pragma once

#include "../Object/ObjectBase/CObjectBase.hpp"


class CRope : public CObjectBase
{

	/*===============================================*/
	//!	
	//! \file
	//! \class CRope
	//!	\brief <b>ロープの管理クラス</b>
	//!
	//! \author Y.Yamamuro \n
	//! \date  2014/10/29
	//! \since 2014/10/29
	//!
	/*================================================*/

public:
	
	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CRope( void );

	/*===================================*/
	//! \brief 個別の初期化
	/*===================================*/
	void DiscreteInit( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CRope( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


	/*=============================================*/
	//! \brief 描画
	//! \param[in] &_d3d	DirectXのデバイス
	/*=============================================*/
	void Draw( CDirect3D &_d3d );


	/*==============================================*/
	//! \brief ロープのアクターを返す
	/*==============================================*/
	inline NxActor** GetRopeSegs( void ){ return m_RopeSegs; }


	static const int PartsNum = 23;


private:


	NxActor **m_RopeSegs;				//!< ロープのカプセルアクター
	NxSphericalJoint **m_RopeLinks;		//!< ロープの関節

	static int m_MaterialIndex;			//!< マテリアルのインデックス番号

};