#pragma once

#include "../SceneManager/CSceneManager.hpp"
#include "../Scene/SceneBase/CSceneBase.hpp"


class CRoomCreate : public CSceneBase
{

	/*============================================================*/
	//!
	//! \file
	//! \class CRoomCreate
	//! \brief <b>部屋作成クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date  2014/11/05
	//! \since 2014/11/05
	//!
	/*============================================================*/

public:


	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CRoomCreate( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CRoomCreate( void );


	/*===========================================*/
	//! \brief 更新
	//! \return シーンの変更 = true
	//! \return 継続 　　　　= false
	/*===========================================*/
	bool Updata( void );


	/*=================================*/
	//! \brief 画面表示
	/*=================================*/
	void Draw( void );


	/*=======================================*/
	//! \brief シーンの名前を返す
	/*=======================================*/
	std::string GetName( void ){ return "RoomCreate"; }


private:


};
