#pragma once

#include "../EnemyBase/CEnemyBase.hpp"


class CTackle : public CEnemyBase
{

	/*========================================================*/
	//!
	//! \file
	//! \class CTackle
	//! \brief <b>主人公を見つけるとタックルしてくる敵</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date 2014/09/11
	//! \since 
	//!
	/*========================================================*/

public:
	
	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CTackle( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CTackle( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );

};