#pragma once 

#include "../../ObjectBase/CObjectBase.hpp"


class CGimmickBase : public CObjectBase
{

	/*=================================================*/
	//!
	//! \file
	//! \class CGimmickBase
	//! \brief <b>ギミックの基底クラス</b>
	//! 
	//! \author	Y.Yamamuro \n
	//! \date 2014/09/10
	//! \since 2014/09/28
	//!
	/*=================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CGimmickBase( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CGimmickBase( void );


	/*==========================================================================================*/
	//! \brief 初期化
	//! \param[in]	_Data		オブジェクトの初期化に使用するデータ
	/*==========================================================================================*/
	void Init( CObjectManager::OBJECT_DATA Data );


	/*======================================*/
	//! \brief ギミックのIDを返す
	/*======================================*/
	inline int GetSenderID( void ){ return m_Sender; }

	/*============================================*/
	//! \brief 動作しているかどうかを返す
	/*============================================*/
	inline bool GetWorking( void ){ return m_bWorking; }


protected:

	int m_Sender;		//!< 電源側のID
	int m_Connector;		//!< どの電力と繋ぐのか
	bool m_bWorking;	//!< 作動しているかのフラグ

};