#pragma once 

#include "../GimmickBase/CGimmickBase.hpp"

class CSwitch : public CGimmickBase
{

	/*========================================================*/
	//!
	//! \file
	//! \class CSwitch
	//! \brief <b>スイッチオブジェクトの管理クラス</b>
	//!
	//! \author	Y.Yamamuro \n
	//! \date  2014/09/16
	//! \since 2014/09/20
	//!
	/*========================================================*/

public:

	/*===============================================*/
	//! \brief デフォルトコンストラクタ
	/*===============================================*/
	CSwitch( void );

	/*===================================*/
	//! \brief 個別の初期化
	/*===================================*/
	void DiscreteInit( void );


	/*=====================================*/
	//! \brief デストラクタ
	/*=====================================*/
	~CSwitch( void );


	/*================================*/
	//! \brief 更新
	/*================================*/
	void Exec( void );


	/*=============================================*/
	//! \brief 描画
	//! \param[in] &_d3d	DirectXのデバイス
	/*=============================================*/
	void Draw( CDirect3D &_d3d );


private:

	NxBox m_worldBox;			//!< オーバーラップで使用する判定用の情報を格納

	CTexture * m_lpPushTexture;	//!< スイッチを押した状態のテクスチャ

};

